#### RDBMS- MySQL

## Necessary Modules

In [ ]:
#(** To avoid error ,first uninstall the modules if exists from before. Then install again.)
#pip3 install mysql-connector-python
# pip3 install mysqlclient
# pip3 install ipython-sql
# pip3 install mypy-extensions
# pip3 install SQLAlchemy
# pip3 install PyMySQL

## Creating a database and connecting to it

In [1]:
#Connecting to MySQL database
import mysql.connector as sql
mydb=sql.connect(host="localhost",user="root",passwd="Mahmud")
mycursor = mydb.cursor()

In [2]:
#Creating a database
mycursor.execute("CREATE DATABASE Problem_set_04")

In [53]:
#Deleting the database
# mycursor.execute("DROP DATABASE Problem_set_04")

In [3]:
%load_ext sql

In [4]:
#Connecting to the database which was created before
%sql mysql://root:Mahmud@localhost/Problem_set_04

## Schema

![Cat](dataset/schema.png)

## Creating necessary table

In [5]:
%%sql
create table Employee(
    employee_id INTEGER,
    name VARCHAR(20),
    months INTEGER,
    salary INTEGER);

 * mysql://root:***@localhost/Problem_set_04
0 rows affected.

[]

In [6]:
%%sql
desc Employee

 * mysql://root:***@localhost/Problem_set_04
4 rows affected.

[('employee_id', 'int', 'YES', '', None, ''),
 ('name', 'varchar(20)', 'YES', '', None, ''),
 ('months', 'int', 'YES', '', None, ''),
 ('salary', 'int', 'YES', '', None, '')]

In [ ]:
# %%sql
# drop table Employee;

## Loading data to the table

In [7]:
%%sql
load data infile "C:/ProgramData/MySQL/MySQL Server 8.0/Uploads/Problem_set_04.csv"
  into table Employee
    fields terminated by ","
      enclosed by '"'
        lines terminated by '\n'
          ignore 1 rows;

 * mysql://root:***@localhost/Problem_set_04
106 rows affected.

[]

In [8]:
%%sql
SELECT * FROM Employee LIMIT 5;

 * mysql://root:***@localhost/Problem_set_04
5 rows affected.

[(330, 'Rose', 5, 2248),
 (1233, 'Angela', 7, 1296),
 (1901, 'Frank', 10, 2763),
 (2035, 'Patrick', 1, 4583),
 (2405, 'Lisa', 7, 4350)]

### Problem 1: Write a query that prints a list of employee names (i.e.: the name attribute) from the Employee table in alphabetical order.

In [9]:
%%sql
SELECT name FROM Employee
  ORDER BY name;

 * mysql://root:***@localhost/Problem_set_04
106 rows affected.

[('Alan',),
 ('Amy',),
 ('Andrew',),
 ('Andrew',),
 ('Angela',),
 ('Angela',),
 ('Ann',),
 ('Anna',),
 ('Anthony',),
 ('Antonio',),
 ('Benjamin',),
 ('Bonnie',),
 ('Brandon',),
 ('Brandon',),
 ('Brian',),
 ('Carol',),
 ('Charles',),
 ('Christina',),
 ('Christina',),
 ('Christine',),
 ('Christine',),
 ('David',),
 ('David',),
 ('David',),
 ('Debra',),
 ('Diana',),
 ('Diana',),
 ('Donna',),
 ('Dorothy',),
 ('Dorothy',),
 ('Dorothy',),
 ('Earl',),
 ('Elizabeth',),
 ('Emily',),
 ('Evelyn',),
 ('Evelyn',),
 ('Evelyn',),
 ('Frank',),
 ('Gerald',),
 ('Gloria',),
 ('Gregory',),
 ('Gregory',),
 ('Harry',),
 ('Jacqueline',),
 ('James',),
 ('James',),
 ('Jean',),
 ('Jennifer',),
 ('Jesse',),
 ('Jesse',),
 ('Joe',),
 ('Joe',),
 ('John',),
 ('John',),
 ('Jonathan',),
 ('Joseph',),
 ('Joyce',),
 ('Joyce',),
 ('Julia',),
 ('Keith',),
 ('Kelly',),
 ('Kevin',),
 ('Kimberly',),
 ('Kimberly',),
 ('Lawrence',),
 ('Lillian',),
 ('Lillian',),
 ('Linda',),
 ('Lisa',),
 ('Lori',),
 ('Louise',),
 ('Maria',),
 ('Marilyn',),
 ('Marilyn',),
 ('Marilyn',),
 ('Martha',),
 ('Martin',),
 ('Matthew',),
 ('Melissa',),
 ('Michael',),
 ('Michelle',),
 ('Nancy',),
 ('Nancy',),
 ('Norma',),
 ('Pamela',),
 ('Patricia',),
 ('Patricia',),
 ('Patrick',),
 ('Paul',),
 ('Paul',),
 ('Paula',),
 ('Paula',),
 ('Phillip',),
 ('Ralph',),
 ('Robert',),
 ('Robin',),
 ('Robin',),
 ('Rose',),
 ('Roy',),
 ('Stephanie',),
 ('Tammy',),
 ('Timothy',),
 ('Todd',),
 ('Victor',),
 ('Walter',),
 ('Willie',)]

### Problem 2:	Write a query that prints a list of employee names (i.e.: the name attribute) for employees in Employee having a salary greater than $2000  per month who have been employees for less than 10 months. Sort your result by ascending employee_id.

In [10]:
%%sql
SELECT name FROM Employee
  WHERE salary>2000 AND months<10
    ORDER BY employee_id

 * mysql://root:***@localhost/Problem_set_04
25 rows affected.

[('Rose',),
 ('Patrick',),
 ('Lisa',),
 ('Amy',),
 ('Pamela',),
 ('Jennifer',),
 ('Julia',),
 ('Kevin',),
 ('Paul',),
 ('Donna',),
 ('Michelle',),
 ('Christina',),
 ('Brandon',),
 ('Joseph',),
 ('Jesse',),
 ('Paula',),
 ('Louise',),
 ('Evelyn',),
 ('Emily',),
 ('Jonathan',),
 ('Nancy',),
 ('Benjamin',),
 ('Roy',),
 ('Diana',),
 ('Christine',)]

### Problem 3: Find the number of Most Senior Employees.

In [20]:
%%sql
SELECT COUNT(*) as "Number of Senior Employees" FROM Employee
  GROUP BY months 
    ORDER BY months DESC
      LIMIT 1

 * mysql://root:***@localhost/Problem_set_04
1 rows affected.

[(8,)]

### Problem 4: We define an employee's total earnings to be their monthly salary x months worked, and the maximum total earnings to be the maximum total earnings for any employee in the Employee table. Write a query to find the maximum total earnings for all employees as well as the total number of employees who have maximum total earnings. Then print these values as 2 space-separated integers.

In [13]:
%%sql
SELECT months*salary as Earnings ,COUNT(*) as "Top Earners" FROM Employee
  GROUP BY 1
    ORDER BY 1 DESC
      LIMIT 1;

 * mysql://root:***@localhost/Problem_set_04
1 rows affected.

[(108064, 7)]